import ctypes
import os
import re
import struct
import sys
import time
import timeit
import io
import json
import random
from collections import OrderedDict

from itertools import groupby

import volatility.debug as debug
import volatility.obj as obj
import volatility.plugins.linux.common as linux_common
from volatility.plugins.linux import pslist as linux_pslist
from volatility.renderers import TreeGrid
from volatility import utils

PROFILE_PATH = "./myplugins/Scripts/ScriptOutputs/profile_py.txt"  # PATH TO PYTHON PROFILE
PROFILE_DATA = None

pyobjs_vtype_64 = { #Found info here: https://github.com/python/cpython/blob/3.6/Include
    '_PyTypeObject': [
        400,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['void']]],  # struct _typeobject *
            'ob_size': [16, ['long long']],  
            'tp_name': [24, ['address']],
            'tp_basicsize': [32, ['long long']],
            'tp_itemsize': [40, ['long long']],
            'data1': [48, ['void']],
            'tp_dictoffset': [288, ['long long']],
            'data2': [296, ['void']]
        }],
    '_PyUnicodeString': [
        80,
        {
            'ob_refcnt': [0, ['long long']],
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  
            'length': [16, ['long long']],  # number of code points
            'ob_hash': [24, ['long long']],
            'ob_state': [32, ['unsigned int']], #interned 0-2, kind 1 2 4, compact 0-1, ascii 0-1, ready 0-1
            'ob_wstr': [36, ['pointer', ['void']]],
            'alignment1': [44, ['void']],
            'utf8_length': [48, ['long long']],
            'utf8_ptr': [56, ['pointer', ['char']]],
            'wstr_length': [64, ['long long']],
            'ob_data': [72, ['pointer', ['char']]]
        }],
    '_PyGC_Head': [
        24,
        {
            'gc_next': [0, ['unsigned long long']],
            'gc_prev': [8, ['unsigned long long']],
            'gc_refs': [16, ['long long']],
        }],
    '_GC_Runtime_State': [
        352,
        {
            'trash_delete_later': [0, ['address']],
            'trash_delete_nesting': [8, ['int']], 
            'enabled': [12, ['int']],
            'debug': [16, ['int']],
            'alignment1': [20, ['void']],
            'gen1_head': [32, ['_PyGC_Head']],
            'gen1_dummy': [56, ['void']],
            'gen1_threshold': [64, ['int']],
            'gen1_count': [68, ['int']],
            'gen1_alignment': [72, ['void']],
            'gen2_head': [80, ['_PyGC_Head']],
            'gen2_dummy': [104, ['void']],
            'gen2_threshold': [112, ['int']],
            'gen2_count': [116, ['int']],
            'gen1_alignment': [120, ['void']],
            'gen3_head': [128, ['_PyGC_Head']],
            'gen3_dummy': [152, ['void']],
            'gen3_threshold': [160, ['int']],
            'gen3_count': [164, ['int']],
            'gen1_alignment': [168, ['void']],
            'generation0': [176, ['pointer', ['_PyGC_Head']]],
            'alignment2': [184, ['void']],
            'perm_gen_head': [192, ['_PyGC_Head']],
            'perm_gen_dummy': [216, ['void']],
            'perm_gen_threshold': [224, ['int']],
            'perm_gen_count': [228, ['int']],
            'end_data': [232, ['void']]
        }],
    '_PyInterpreters': [
        32,
        {
            'interpreters_mutex': [0, ['address']],
            'interpreters_head': [8, ['address']], 
            'interpreters_main': [16, ['address']],
            'interpreters_next_id': [24, ['long long']],
        }],
    '_PyRuntimeState': [ 
        1520,
        {
            'initialized': [0, ['int']],
            'core_initialized': [4, ['int']],  
            'finalizing': [8, ['pointer', ['void']]], 
            'interpreters': [16, ['_PyInterpreters']],
            'exitfuncs': [48, ['void']],
            'nexitfuncs': [304, ['int']],
            'alignment1': [308, ['void']],
            'gc': [320, ['_GC_Runtime_State']],
            'end_data': [672, ['void']]
        }],
    '_PyDictKeyEntry1': [
        24,
        {
            'me_hash': [0, ['long long']],  # Py_ssize_t = ssize_t
            'me_key': [8, ['pointer', ['_PyUnicodeString']]],
            'me_value': [16, ['address']]
        }],
    '_PyDictKeysObject1': [
        48,
        {
            'dk_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'dk_size': [8, ['long long']],  # Py_ssize_t = ssize_t
            'dk_lookup': [16, ['pointer', ['void']]], 
            'dk_usable': [24, ['long long']], 
            'dk_nentries': [32, ['long long']],
            'dk_indices': [40, ['void']]
        }],
    '_PyDictObject1': [
        48,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
            'ma_used': [16, ['long long']],  # number of items
            'ma_version_tag': [24, ['unsigned long long']], #unique identifier
            'ma_keys': [32, ['pointer', ['_PyDictKeysObject1']]], #PyDictKeysObject
            'ma_values': [40, ['pointer', ['void']]] #just values
        }],
    '_PyInstanceObject1': [
        32,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
            'in_dict': [16, ['pointer', ['_PyDictObject1']]],  #Points to __dict__
            'data': [24, ['void']]
        }],
    '_PyFloatObject1': [
        24,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
            'ob_fval': [16, ['long long']]  #double ob_fval //will convert later
        }],
    '_PyTupleObject1': [
        32,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
            'ob_size': [16, ['long long']],  # Py_ssize_t = ssize_t
            'ob_item': [24, ['pointer', ['void']]]
        }],
    '_PyLongObject1': [
        32,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
            'ob_size': [16, ['long long']],
            'ob_digit': [24, ['unsigned int']]
        }],
    '_PyListObject1': [
        40,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
            'ob_size': [16, ['long long']],  # Py_ssize_t = ssize_t
            'ob_item': [24, ['pointer', ['void']]],
            'allocated': [32, ['long long']]
        }],
    '_PyBoolObject1': [
        32,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
            'ob_size': [16, ['long long']],
            'ob_digit': [24, ['unsigned int']]
        }],
    '_PyEagerTensor1': [
        152,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
            'unused': [16, ['void']],
            'handle': [80, ['address']],
            'ob_id': [88, ['long long']],
            'is_packed': [96, ['long long']],
            'handle_data': [104, ['address']],
            'tensor_shape': [112, ['address']],
            'ob_status': [120, ['void']],
            'context': [128, ['address']],
            'weakreflist': [136, ['address']],
            'ob_dict': [144, ['_PyDictObject1']],
        }],
    '_PyDimension1': [
        32,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
            'ob_dim': [16, ['pointer', ['_PyLongObject1']]],
            'model_ptr': [24, ['pointer', ['void']]]
        }],
    '_TensorShape1': [
        32,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
            'ob_list': [16, ['pointer', ['_PyListObject1']]]
        }],
    'float32': [
        4,
        {
            'ob_fval': [0, ['int']]
        }],
    '_TensorBuffer1': [
        24,
        {
            'vtable_ptr': [0, ['pointer', ['address']]],  # ptr to vtable
            'ob_refcnt': [8, ['long long']],
            'data_': [16, ['pointer', ['float32']]]
        }],
    '_Tensor1': [
        32,
        {
            'shape': [0, ['array', 8, ['unsigned short int']]],  
            'num_elements': [16, ['long long']],
            'buf_': [24, ['pointer', ['_TensorBuffer1']]]
        }],
    '_PyObject1': [
        16,
        {
            'ob_refcnt': [0, ['long long']],  # Py_ssize_t = ssize_t
            'ob_type': [8, ['pointer', ['_PyTypeObject']]],  # struct _typeobject *
        }]
    }
    

class _PyTypeObject(obj.CType):
    def check_char(self, c):
        #make sure tp_name is one of these characters
        s = "1234567890qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM._-\/%"
        if c in s:
            return True
        else:
            return False
    
    @property
    def name(self):
        ret = ""
        for i in range(50):
            tmp = self.obj_vm.zread(self.tp_name + i, 1)
            if ord(tmp) == 0:
                if (i >= 2):
                    return ret
                else:
                    return "invalid"
            if not self.check_char(tmp):
                return "invalid"
            ret += tmp
        return "invalid"

    def is_valid(self):
        if not (self.ob_type.is_valid() and self.tp_name.is_valid() and self.tp_basicsize.is_valid()):
            return False
        return True


class _PyUnicodeString(obj.CType):
    def parse_state(self):
        interned = kind = compact = ascii_tmp = ready = -1

        if (self.ob_state >> 1) & 1 and not((self.ob_state >> 0) & 1): #interned
            interned = 2
        elif not(self.ob_state >> 1) & 1 and (self.ob_state >> 0) & 1:
            interned = 1
        elif not(self.ob_state >> 1) & 1 and not((self.ob_state >> 0) & 1):
            interned = 0

        if (self.ob_state >> 4) & 1: #kind
            if not((self.ob_state >> 3) & 1) and not((self.ob_state >> 2) & 1):
                kind = 4
        else:
            if ((self.ob_state >> 3) & 1) and not((self.ob_state >> 2) & 1):
                kind = 2
            elif not((self.ob_state >> 3) & 1) and ((self.ob_state >> 2) & 1):
                kind = 1
            elif not((self.ob_state >> 3) & 1) and not((self.ob_state >> 2) & 1):
                kind = 0
        
        compact = int(((self.ob_state >> 5) & 1))
        ascii_tmp = int(((self.ob_state >> 6) & 1))
        ready = int(((self.ob_state >> 7) & 1))

        return interned, kind, compact, ascii_tmp, ready

    def is_valid(self): #ob_hash is different from Python's builtin hash
        if not (self.ob_type.is_valid() and self.ob_type.dereference().is_valid()
                and self.length > 0 and self.length <= 1e2 and self.ob_hash.is_valid()
                and self.ob_type.dereference().tp_basicsize == 80):
            return False

        interned, kind, compact, ascii_tmp, ready = self.parse_state()

        #ignore ready legacy or unready legacy or compact unicode
        if interned == -1 or kind <= 0 or compact <= 0 or ascii_tmp <= 0 or ready <= 0: 
            return False
        else:
            return True

    @property
    def val(self):
        interned, kind, compact, ascii_tmp, ready = self.parse_state()

        if ascii_tmp == 1: #should go here, never encountered compact unicode before
            uni_buff = self.obj_vm.zread(self.obj_offset + 48, self.length)
            return uni_buff
        elif ascii_tmp == 0: 
            uni_buff = self.obj_vm.zread(self.obj_offset + 72, self.length)
            print uni_buff.encode("utf-8")
            return uni_buff.decode()


class _PyGC_Head(obj.CType):
    def is_valid(self):
        return (self.gc_next.is_valid() and self.gc_prev.is_valid() and self.gc_refs.is_valid())

    @property
    def next_val(self):
        return self.gc_next

    @property
    def prev_val(self):
        return self.gc_prev
    

class _GC_Runtime_State(obj.CType):
    def is_valid(self):
        return (self.trash_delete_later.is_valid() and self.trash_delete_nesting.is_valid()
            and self.gen1_head.is_valid() and self.gen2_head.is_valid() and self.gen3_head.is_valid())


class _PyInterpreters(obj.CType):
    def is_valid(self):
        return (self.interpreters_mutex.is_valid() and self.interpreters_head.is_valid()
            and self.interpreters_main.is_valid())


class _PyRuntimeState(obj.CType):
    def is_valid(self):
